ant
apktool
ascii
asciidoctor
asciinema
aspell
astyle
atk
autoconf
automake
awscli
bazaar
bc
beanstalkd
boost
c-ares
cairo
cassandra
cloog
cmake
cockroach
consul
consul-template
cscope
csshx
curl
cython
dbus
dex2jar
erlang
fontconfig
freetype
fribidi
gawk
gcc
gd
gdbm
gdk-pixbuf
geoip
gettext
ghostscript
git
glib
glide
gmp
gnutls
go
gradle
graphite2
graphviz
grep
groovy
gts
haproxy
harfbuzz
hexyl
hicolor-icon-theme
httpie
hugo
icu4c
ipython
ircii
isl
jabba
jansson
jasper
jemalloc
jenv
jpeg
jq
jsoncpp
kibana
kubernetes-cli
libcouchbase
libepoxy
libev
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libmaxminddb
libmemcached
libmpc
libpng
libsmi
libssh
libssh2
libtasn1
libtermkey
libtiff
libtool
libunistring
libuv
libvterm
libyaml
lua
lua@5.1
luajit
lzo
make
maven
memcached
mercurial
mitmproxy
most
mpfr
msgpack
mysql-connector-c
ncurses
neovim
netcat
netpbm
nettle
nghttp2
nmap
node
oniguruma
openssl
openssl@1.1
p11-kit
pandoc
pango
parallel
pcre
pcre2
perl
pgbadger
pixman
pkg-config
protobuf
prototool
pyenv
python
python@2
rainbarf
readline
reattach-to-user-namespace
redis
rsync
ruby
rustup-init
s-lang
scdoc-custom
solr
spdylay
sphinx-doc
sqlite
stern
sysdig
tbb
terraform
the_silver_searcher
tmux
tokyo-cabinet
tree
unbound
unibilium
universal-ctags
utf8proc
vault
vim
watch
webp
weechat --with-perl --with-aspell --with-python@2
wget
wireshark
wxmac
xz
zeromq
zlib
zsh
