0xed
android-file-transfer
android-platform-tools
android-studio
atom
authy
brave-browser
caffeine
cubicsdr
eclipse-java
evernote
firefox
google-chrome
google-cloud-sdk
google-drive-file-stream
google-hangouts
intellij-idea
iterm2
java
krisp
mactex
nordvpn
oracle-jdk
osxfuse
pycharm
skype
soundflower
spotify
steam
transmission
tunnelblick
vagrant
virtualbox
vlc
vnc-viewer
wechat
whatsapp
wireshark
vmware-fusion
amethyst
