# Window Management & System
amethyst
caffeine
logi-options+

# Development Environment  
android-file-transfer
android-platform-tools
android-studio
intellij-idea
eclipse-java
cursor
claude
utm
visualvm

# Terminal & Development Tools
iterm2
ghostty
font-inconsolata-nerd-font

# Cloud & DevOps
google-cloud-sdk
gcloud-cli
google-drive-file-stream

# Browsers
brave-browser
firefox
google-chrome

# Communication & Social
telegram-desktop
lark
wechat
whatsapp
zoom

# Media & Entertainment
vlc
jellyfin-media-player
steam
tidal

# Network & Security
tunnelblick
cloudflare-warp
bitwarden

# Specialized Tools
cubicsdr
via

# Java Development
oracle-jdk
jdk-mission-control

# Document Processing
mactex

# Mobile Development
flutter

# Other Utilities
krisp
evernote
