android-platform-tools
ant
apktool
ascii
astyle
autoconf
automake
bazaar
bc
beanstalkd
boost
c-ares
cassandra
cloog
cloog018
cmake
consul
cscope
csshx
ctags
curl
cython
dbus
delve
dex2jar
ecj
elasticsearch
fontconfig
freetype
gawk
gcc
gd
gdbm
geoip
gettext
git
glib
glide
gmp
gmp4
gmp@4
gnutls
go
godep
gradle
graphviz
grep
groovy
haproxy
httpie
hugo
icu4c
ircii
isl
isl011
isl@0.11
isl@0.12
jansson
jemalloc
jpeg
jsoncpp
kibana
libcouchbase
libev
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libmpc
libmpc08
libmpc@0.8
libpng
libtasn1
libtermkey
libtiff
libtool
libunistring
libuv
libvterm
libyaml
lua
luajit
macvim
make
maven
mercurial
mpfr
mpfr2
mpfr@2
msgpack
mysql-connector-c
neovim
nettle
nghttp2
nmap
node
openssl
openssl@1.1
p11-kit
pandoc
parallel
pcre
perl
pgbadger
pkg-config
protobuf
pypy
python
python3
python@2
readline
reattach-to-user-namespace
redis
rsync
ruby
solr
spdylay
sqlite
sysdig
the_silver_searcher
tmux
tokyo-cabinet
tree
unibilium
utf8proc
vim --override-system-vi --with-client-server --with-lua
watch
webp
wget
wireshark
xz
yarn
zlib
zsh
