amethyst
android-file-transfer
android-platform-tools
android-studio
atom
authy
brave-browser
caffeine
cloudflare-warp
cubicsdr
eclipse-java
evernote
firefox
flutter
google-cloud-sdk
google-drive
google-drive-file-stream
intellij-idea
iterm2
jdk-mission-control
krisp
mactex
nordvpn
oracle-jdk
pycharm
skype
steam
tidal
tunnelblick
vagrant
via
vlc
vnc-viewer
wechat
whatsapp
zoom
