# Brewfile - Homebrew Bundle
# Install with: brew bundle install --file=Brewfile
# Check status: brew bundle check --file=Brewfile

# =============================================================================
# Taps
# =============================================================================
tap "clojure-lsp/brew"
tap "hashicorp/tap"

# =============================================================================
# Brews (CLI Tools & Libraries)
# =============================================================================

# Core System Tools
brew "coreutils"
brew "curl"
brew "wget"
brew "gnu-sed"
brew "grep"
brew "make"
brew "cmake"
brew "bc"
brew "rsync"
brew "tree"
brew "watch"
brew "parallel"

# Modern CLI Tools
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "jq"
brew "httpie"
brew "hexyl"
brew "fq"
brew "ghz"
brew "grpcurl"
brew "just"

# Shell & Terminal
brew "zsh"
brew "tmux"
brew "neovim"
brew "most"
brew "reattach-to-user-namespace"

# Version Control
brew "git"

# Development Tools
brew "gcc"
brew "golangci-lint"
brew "rust-analyzer"
brew "delve"
brew "clang-format"
brew "pre-commit"
brew "trufflehog"
brew "tree-sitter"
brew "universal-ctags", args: ["HEAD"]

# AI CLI Tools
brew "gemini-cli"
brew "claude-code-templates"

# Languages & Runtimes
brew "go"
brew "node"
brew "python"
brew "perl"
brew "lua"
brew "luajit"
brew "rustup-init"
brew "groovy"
brew "scala"

# Language Management
brew "nvm"
brew "pyenv"
brew "jenv"
brew "jabba"

# Java & JVM
brew "openjdk"
brew "gradle"
brew "maven"
brew "leiningen"

# DevOps & Cloud Tools
brew "awscli"
brew "kubernetes-cli"
brew "k9s"
brew "helm"
brew "helmfile"
brew "stern"
brew "terragrunt"
brew "consul-template"
brew "vault"
brew "colima"
brew "docker"
brew "docker-compose"
brew "argocd"
brew "glooctl"
brew "minikube"
brew "tailscale"

# Security & Network Tools
brew "nmap"
brew "netcat"
brew "wireshark"

# Data & Documentation
brew "pandoc"
brew "hugo"
brew "sphinx-doc"
brew "cookiecutter"

# System Libraries
brew "openssl@3"
brew "protobuf"

# Specialized Tools
brew "todo-txt"
brew "weechat"
brew "sysdig"
brew "qemu"
brew "ollama"
brew "clojure"
brew "clojure-lsp/brew/clojure-lsp-native"

# Tap-specific packages
brew "hashicorp/tap/terraform"

# =============================================================================
# Casks (GUI Applications)
# =============================================================================

# Window Management & System
cask "amethyst"
cask "caffeine"
cask "logi-options+"

# Development Environment
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "intellij-idea"
cask "cursor"
cask "claude"
cask "utm"
cask "visualvm"

# Terminal & Development Tools
cask "iterm2"
cask "ghostty"
cask "claude-code"
cask "codex"
cask "font-inconsolata-nerd-font"

# Cloud & DevOps
cask "consul"
cask "gcloud-cli"
cask "google-drive"

# Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Communication & Social
cask "telegram-desktop"
cask "lark"
cask "whatsapp"
cask "zoom"

# Media & Entertainment
cask "vlc"
cask "jellyfin-media-player"
cask "steam"
cask "tidal"

# Network & Security
cask "cloudflare-warp"
cask "bitwarden"
cask "mitmproxy"
cask "wireshark-app"

# Specialized Tools
cask "cubicsdr"
cask "via"

# Java Development
cask "oracle-jdk"
cask "jdk-mission-control"

# Document Processing
cask "mactex"

# Mobile Development
cask "flutter"

# Productivity & Notes
cask "krisp"
cask "evernote"
cask "antigravity"
cask "obsidian"
cask "rustdesk"
