ant
apktool
aspell
astyle
awscli
bc
cmake
consul
consul-template
coreutils
colima
cscope
csshx
curl
cython
erlang
gawk
gcc
gd
gdbm
gettext
ghostscript
git
glib
glide
gnutls
gnu-sed
go
gradle
graphite2
graphviz
grep
groovy
haproxy
helm
hexyl
httpie
hugo
ipython
ircii
jabba
jemalloc
jenv
jpeg
jq
kafkacat
kibana
kubernetes-cli
leiningen
libcouchbase
libevent
libffi
libgcrypt
libgpg-error
libmaxminddb
libmemcached
libmpc
libpng
libssh
libssh2
libtasn1
libtiff
libunistring
libuv
libvterm
lua
luajit
make
maven
memcached
mercurial
minikube
mitmproxy
most
msgpack
mysql-client
mysql-connector-c
ncurses
neovim
netcat
netpbm
nettle
nghttp2
nmap
node
openjdk
openssl
pandoc
parallel
pcre
pcre2
perl
pgbadger
pixman
pkg-config
protobuf
prototool
pyenv
python
qemu
rainbarf
readline
reattach-to-user-namespace
redis
rsync
ruby
rustup-init
sphinx-doc
sqlite
stern
sysdig
terraform
the_silver_searcher
tmux
todo-txt
tree
unbound
vault
vim
watch
webp
weechat
wget
wireshark
zlib
zsh
