# Core System Tools
sysstat
util-linux-user
lshw
iotop
iftop
bridge-utils

# Modern CLI Tools
bat
# eza - see cargo_list
fzf
ripgrep
zoxide
git-delta
difftastic
yazi
most
htop
hugo
ffmpeg-free
poppler-utils

# Shell & Development
zsh
tmux
neovim
vim
cmake
make
gcc-c++

# Languages & Runtimes
golang
python-devel
nodejs
java-latest-openjdk-devel

# Container & Virtualization
moby-engine
docker-compose

# Network & Security Tools
wireguard-tools

# File System & Storage
btrfs-progs
btrbk
rclone

# Development & Build Tools
protobuf
protobuf-compiler
freetype-devel

# GUI Applications
# GUI apps are managed via flatpak_list (telegram, vlc, ghostwriter, etc.)
ghostty
pavucontrol
NetworkManager-tui

# Android Development
android-tools
android-file-transfer

# Text Processing
texlive
