sysstat
gnome-tweak-tool
docker
docker-compose
the_silver_searcher
tmux
lshw
golang
opam
freetype-devel
ghostwriter
most
neovim
hugo
rsyslog fail2ban sendmail
util-linux-user
telegram-desktop
setools-gui
setroubleshoot
protobuf
protobuf-compiler
vlc
variety
rofi
android-tools
android-file-transfer
lxappearance
NetworkManager-tui
light
pavucontrol
netdata
blueman
wireguard-tools
bcc
bcc-tools
bcc-doc
bpftrace
iotop
btrfs-progs
btrfs-heatmap
btrbk
rclone
iftop
kubernetes
bridge-utils
texlive
ruby-devel
rubygems
