# Core System Tools
sysstat
util-linux-user
lshw
iotop
iftop
bridge-utils

# Modern CLI Tools
bat
eza
fzf
ripgrep
zoxide
most
hugo

# Shell & Development
zsh
tmux
neovim
vim
cmake
make
gcc-c++

# Languages & Runtimes
golang
python-devel
opam
nodejs

# Container & Virtualization  
docker
docker-compose

# DevOps & Cloud Tools
kubernetes
google-cloud-sdk
google-cloud-sdk-gke-gcloud-auth-plugin

# Network & Security Tools
rsyslog
fail2ban
sendmail
wireguard-tools

# System Monitoring & Performance
bcc
bcc-tools
bcc-doc
bpftrace
netdata

# File System & Storage
btrfs-progs
btrfs-heatmap
btrbk
rclone

# Development & Build Tools
protobuf
protobuf-compiler
freetype-devel

# GUI Applications (Fedora specific)
gnome-tweak-tool
telegram-desktop
vlc
variety
chromium-freeworld
ghostty
ghostwriter
pavucontrol
blueman
light
lxappearance
NetworkManager-tui

# Window Manager & Desktop
rofi
gnome-shell-extension-pop-shell
xprop

# Android Development
android-tools
android-file-transfer

# Security & System Management
setools-gui
setroubleshoot

# Text Processing
texlive